ATsupportum/src/Catalogs/ГруппыШаблоновЗаявок_ат/ГруппыШаблоновЗаявок_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыШаблоновЗаявок_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеШаблоны</name>
      <description>Все шаблоны</description>
    </items>
  </predefined>
  <attributes>
    <name>Индивидуальная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ГруппыШаблоновЗаявок_ат/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка = Справочники.ГруппыШаблоновЗаявок_ат.ВсеШаблоны Тогда
		Если НЕ Родитель.Пустая() Тогда
			ВызватьИсключение "Предопределенная группа ""Все шаблоны"" может быть только в корне.";
		КонецЕсли;
	ИначеЕсли Родитель = Справочники.ГруппыШаблоновЗаявок_ат.ВсеШаблоны Тогда
		ВызватьИсключение "Предопределенная группа ""Все шаблоны"" не может быть родителем.";
	КонецЕсли;

	Если НЕ Индивидуальная Тогда
		Пользователь = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
